// Напишите программу, которая принимает на вход
//и выдает  количесво чифр в числе

void FindColl(int a)
{
    string len = a.ToString().Length;
    int b = len.Length();
    Console.WriteLine(b);
}
FindColl(1234583);
